import java.io.*;
import java.util.*;

public class Main {

    public static void main(String[] args) {

        // ===== 테스트 1 (3x4) =====
        // int[][] gold = {
        //         {1, 3, 3, 2},
        //         {2, 1, 4, 1},
        //         {0, 6, 4, 7}
        // };

        // ===== 테스트 2 (4x4) =====
        // int[][] gold = {
        //         {1, 3, 1, 5},
        //         {2, 2, 4, 1},
        //         {5, 0, 2, 3},
        //         {0, 6, 1, 2}
        // };

        // ===== 대형 테스트 (20x20) =====
        int[][] gold = {
                {2,7,1,8,2,8,1,8,2,8,4,6,1,0,5,7,7,8,1,6},
                {3,1,4,1,5,9,2,6,5,3,5,8,9,7,9,3,2,3,8,4},
                {6,2,6,4,3,3,8,3,2,7,9,5,0,2,8,8,4,1,9,7},
                {1,6,9,3,9,9,3,7,5,1,0,5,8,2,0,9,7,4,9,4},
                {4,5,9,2,3,0,7,8,1,6,4,0,6,2,8,6,2,0,8,9},
                {9,8,6,2,8,0,3,4,8,2,5,3,4,2,1,1,7,0,6,7},
                {9,8,2,1,4,8,0,8,6,5,1,3,2,8,2,3,0,6,6,4},
                {7,0,9,3,8,4,4,6,0,200,5,5,0,5,8,2,2,3,1,7},
                {2,5,3,5,9,4,0,8,1,2,8,4,8,1,1,1,7,4,5,0},
                {2,8,4,1,0,2,7,0,1,9,3,8,5,2,1,1,0,5,5,5},
                {9,6,4,4,6,2,2,9,4,8,9,5,4,9,3,0,3,8,1,9},
                {6,4,4,2,8,8,1,0,9,7,5,6,6,5,9,3,3,4,4,6},
                {1,2,8,4,7,5,6,4,8,2,3,3,7,8,6,7,8,3,1,6},
                {5,2,7,1,2,0,1,9,0,9,1,4,5,6,4,8,5,6,6,9},
                {2,3,4,6,0,3,4,8,6,1,0,4,5,4,3,2,6,6,4,8},
                {2,1,3,3,9,3,6,0,7,2,6,0,2,4,9,1,4,1,2,7},
                {3,7,2,4,5,8,7,0,0,6,6,0,6,3,1,5,5,8,8,1},
                {7,4,8,8,1,5,2,0,9,2,0,9,6,2,8,2,9,2,5,4},
                {0,9,1,7,1,5,3,6,4,3,6,7,8,9,2,9,1,4,6,5},
                {7,3,1,6,2,8,3,4,6,2,6,4,3,3,8,3,2,7,9,5}
        };

        int n = gold.length;
        int m = gold[0].length;

        // 여기서 DP 코드 작성해서 테스트하면 됨

        System.out.println("res : " + dp(gold , n, m));

        // 일단 배열 순회
    }

    public static int  dp(int[][] gold , int n, int m){
        // dp 는 memo가 아님, memo는 대표적문제, dp 는 문제를 쪼갤수 있느냐임
        // 근데 매모로 되네...  
        // 시작 = 1열 어디서든 가능
        // 이동가능 =케이스
        // 1. i-- , j++ 오른쪽위
        // 2. i== , j++ 오른쪽
        // 3. i++ , j++


        // 엣지케이스  
        // 1. 하나에 몰려있을수 있음 그리디 불가
        // 2. 같은크기 배열에 최대값 기록해줌
        // 3. i < 0; i > n; j > m, 케이스 예외처리

        int res = 0;

        // 왼쪽 열 가능한 케이스 다 더해서 최대갑만 메모할 배열
        int[][] memo = Arrays.stream(gold)
                        .map(int[]::clone)
                        .toArray(int[][]::new);

        for(int j = 1; j < m; j++){
            for(int i = 0; i < n; i++){
                // 두번째 이상부터
                // 왼쪽 위, 왼쪽, 왼쪽 아래 검사

                int max = 0;
                // 왼쪽 위 : i-1, j-1
                if(i - 1 >= 0 && memo[i-1][j-1] > max){
                    max = memo[i-1][j-1];
                }
                // 왼쪽 : i==, j-1
                if(memo[i][j-1] > max){
                    max = memo[i][j-1];
                }

                // 왼쪽 아래 : i++, j-1
                if(i + 1 < n && memo[i + 1][j-1] > max){
                    max = memo[i + 1][j-1];
                }

                memo[i][j] += max;

            }
        }

        
        // 메모된 마지막 값중 최대값
        for(int i = 0; i < n; i++){
            if(memo[i][m-1] > res){
                res = memo[i][m-1];
            }

        }

        return res;
    }
}